web/searchapp/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def search
    if params[:q].empty?
      @articles = Article.all

INSERT INTO "articles" ("content", "created_at", "published_on", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "dolor"], ["created_at", Sat, 11 May 2013 16:24:20 UTC +00:00], ["published_on", Sat, 11 May 2013], ["title", "20"], ["updated_at", Sat, 11 May 2013 16:24:20 UTC +00:00]]
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "17"]]
UPDATE "articles" SET "content" = 'la vaca llora al costádo del camino', "updated_at" = '2013-05-24 03:40:44.727511' WHERE "articles"."id" = 17
---
  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])